app/views/pages/_form.html.erb

SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL) ORDER BY position
---
<p class = "parent_id">
    <%= f.collection_select :parent_id, Page.all, :id, :title, :include_blank => true %>