app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL) ORDER BY position

  def show
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL) ORDER BY position

  def edit
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL) ORDER BY position

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("name", "title", "body", "created_at", "updated_at") VALUES ('about', 'About Us', '<h1>This is the about us page</h1>', '2013-03-29 04:00:18.884111', '2013-03-29 04:00:18.884111')

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 5 LIMIT 1
UPDATE "pages" SET "body" = '# This is the about us page', "updated_at" = '2013-04-15 20:06:09.016534' WHERE "pages"."id" = 2

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 7]]